app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."artist_id" = ? LIMIT 1  [["artist_id", 1], ["artist_id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path
       else
        @song = artist.songs.find_by(artist_id: params[:artist_id])
        redirect_to artist_songs_path(artist)
      end
    else
       @song = Song.find(params[:id])